&НаСервере
Процедура ПриОткрытииНаСервере()
	Склад.Очистить();	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Товар КАК Товар,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ЦеныПродажиТоваров.Цена КАК Цена
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки КАК ОстаткиТоваровОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПродажиТоваров КАК ЦеныПродажиТоваров
		|		ПО ОстаткиТоваровОстатки.Товар = ЦеныПродажиТоваров.Товар";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Стр = Склад.Добавить();
		Стр.Товар = ВыборкаДетальныеЗаписи.Товар;
		Стр.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		Стр.Цена = ВыборкаДетальныеЗаписи.Цена;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере   
Процедура ОтборИЗаполнениеПоТипуИПроизводителю()
   Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ОстаткиТоваровОстатки.Товар КАК Товар,
				|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
				|	ЦеныПродажиТоваров.Цена КАК Цена
				|ИЗ
				|	РегистрНакопления.ОстаткиТоваров.Остатки КАК ОстаткиТоваровОстатки
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПродажиТоваров КАК ЦеныПродажиТоваров
				|		ПО ОстаткиТоваровОстатки.Товар = ЦеныПродажиТоваров.Товар
				|ГДЕ
				|	ОстаткиТоваровОстатки.Товар.Ссылка В ИЕРАРХИИ(&Ссылка)
				|	И ОстаткиТоваровОстатки.Товар.Производитель = &Производитель";
		    	
			Запрос.УстановитьПараметр("Производитель", Товар.Производитель);
			Запрос.УстановитьПараметр("Ссылка", Товар.Родитель);
	
			РезультатЗапроса = Запрос.Выполнить();
		
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Стр = Склад.Добавить();
				Стр.Товар = ВыборкаДетальныеЗаписи.Товар;
				Стр.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
				Стр.Цена = ВыборкаДетальныеЗаписи.Цена;
			КонецЦикла;

КонецПроцедуры

&НаСервере		
Процедура ОтборИЗаполнениеПоТипуИЦвету()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Товар КАК Товар,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ЦеныПродажиТоваров.Цена КАК Цена
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки КАК ОстаткиТоваровОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПродажиТоваров КАК ЦеныПродажиТоваров
		|		ПО ОстаткиТоваровОстатки.Товар = ЦеныПродажиТоваров.Товар
		|ГДЕ
		|	ОстаткиТоваровОстатки.Товар.Ссылка В ИЕРАРХИИ(&Ссылка)
		|	И ОстаткиТоваровОстатки.Товар.Цвет = &Цвет";
	
	Запрос.УстановитьПараметр("Ссылка", Товар.Родитель);
	Запрос.УстановитьПараметр("Цвет", Товар.Цвет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Стр = Склад.Добавить();
		Стр.Товар = ВыборкаДетальныеЗаписи.Товар;
		Стр.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		Стр.Цена = ВыборкаДетальныеЗаписи.Цена;
	КонецЦикла;
		
КонецПроцедуры			

Процедура ОтборИЗаполнениеПоПроизводителюИЦвету()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Товар КАК Товар,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ЦеныПродажиТоваров.Цена КАК Цена
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки КАК ОстаткиТоваровОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПродажиТоваров КАК ЦеныПродажиТоваров
		|		ПО ОстаткиТоваровОстатки.Товар = ЦеныПродажиТоваров.Товар
		|ГДЕ
		|	ОстаткиТоваровОстатки.Товар.Производитель = &Производитель
		|	И ОстаткиТоваровОстатки.Товар.Цвет = &Цвет";
	
	Запрос.УстановитьПараметр("Производитель", Товар.Производитель);
	Запрос.УстановитьПараметр("Цвет", Товар.Цвет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Стр = Склад.Добавить();
				Стр.Товар = ВыборкаДетальныеЗаписи.Товар;
				Стр.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
				Стр.Цена = ВыборкаДетальныеЗаписи.Цена;
			КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОтборИЗаполнениеПоТипуПроизводителюИЦвету()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Товар КАК Товар,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ЦеныПродажиТоваров.Цена КАК Цена
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки КАК ОстаткиТоваровОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПродажиТоваров КАК ЦеныПродажиТоваров
		|		ПО ОстаткиТоваровОстатки.Товар = ЦеныПродажиТоваров.Товар
		|ГДЕ
		|	ОстаткиТоваровОстатки.Товар.Ссылка В ИЕРАРХИИ(&Ссылка)
		|	И ОстаткиТоваровОстатки.Товар.Производитель = &Производитель
		|	И ОстаткиТоваровОстатки.Товар.Цвет = &Цвет";
	
	Запрос.УстановитьПараметр("Производитель", Товар.Производитель);
	Запрос.УстановитьПараметр("Ссылка", Товар.Родитель);
	Запрос.УстановитьПараметр("Цвет", Товар.Цвет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Стр = Склад.Добавить();
		Стр.Товар = ВыборкаДетальныеЗаписи.Товар;
		Стр.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		Стр.Цена = ВыборкаДетальныеЗаписи.Цена;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ТипТовараПриИзмененииНаСервере()
	Если НЕ Товар.Родитель.Пустая() Тогда
		Склад.Очистить();
		
		Если Товар.Производитель.Пустая() И Товар.Цвет.Пустая() Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ОстаткиТоваровОстатки.Товар КАК Товар,
				|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
				|	ЦеныПродажиТоваров.Цена КАК Цена
				|ИЗ
				|	РегистрНакопления.ОстаткиТоваров.Остатки КАК ОстаткиТоваровОстатки
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПродажиТоваров КАК ЦеныПродажиТоваров
				|		ПО ОстаткиТоваровОстатки.Товар = ЦеныПродажиТоваров.Товар
				|ГДЕ
				|	ОстаткиТоваровОстатки.Товар.Ссылка В ИЕРАРХИИ(&Ссылка)";
			
			Запрос.УстановитьПараметр("Ссылка", Товар.Родитель);
			
			РезультатЗапроса = Запрос.Выполнить();
		
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Стр = Склад.Добавить();
				Стр.Товар = ВыборкаДетальныеЗаписи.Товар;
				Стр.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
				Стр.Цена = ВыборкаДетальныеЗаписи.Цена;
			КонецЦикла;
	
		ИначеЕсли НЕ Товар.Производитель.Пустая() И Товар.Цвет.Пустая() Тогда
			
			ОтборИЗаполнениеПоТипуИПроизводителю();		
			
		ИначеЕсли Товар.Производитель.Пустая() И НЕ Товар.Цвет.Пустая()Тогда  
			
			ОтборИЗаполнениеПоТипуИЦвету();   
			
		Иначе  
			
			ОтборИЗаполнениеПоТипуПроизводителюИЦвету();
			
КонецЕсли;
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипТовараПриИзменении(Элемент)
	ТипТовараПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТоварПроизводительПриИзмененииНаСервере()
	Если НЕ Товар.Производитель.Пустая() Тогда
		Склад.Очистить();
		
		Если Товар.Родитель.Пустая() И Товар.Цвет.Пустая() Тогда
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Товар КАК Товар,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ЦеныПродажиТоваров.Цена КАК Цена
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки КАК ОстаткиТоваровОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПродажиТоваров КАК ЦеныПродажиТоваров
		|		ПО ОстаткиТоваровОстатки.Товар = ЦеныПродажиТоваров.Товар
		|ГДЕ
		|	ОстаткиТоваровОстатки.Товар.Производитель = &Производитель";
	
	Запрос.УстановитьПараметр("Производитель", Товар.Производитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Стр = Склад.Добавить();
		Стр.Товар = ВыборкаДетальныеЗаписи.Товар;
		Стр.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		Стр.Цена = ВыборкаДетальныеЗаписи.Цена;
	КонецЦикла;
	
ИначеЕсли НЕ Товар.Родитель.Пустая() И Товар.Цвет.Пустая() Тогда
	
	ОтборИЗаполнениеПоТипуИПроизводителю();
	
ИначеЕсли Товар.Родитель.Пустая() И НЕ Товар.Цвет.Пустая() Тогда
	
	ОтборИЗаполнениеПоПроизводителюИЦвету();
	
Иначе                                  
	
	ОтборИЗаполнениеПоТипуПроизводителюИЦвету();		
		
	КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварПроизводительПриИзменении(Элемент)
	ТоварПроизводительПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТоварЦветПриИзмененииНаСервере()
	
	Если НЕ Товар.Цвет.Пустая() Тогда
		
		Склад.Очистить();   
		
		Если Товар.Родитель.Пустая() И Товар.Производитель.Пустая() Тогда
			
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Товар КАК Товар,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ЦеныПродажиТоваров.Цена КАК Цена
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки КАК ОстаткиТоваровОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПродажиТоваров КАК ЦеныПродажиТоваров
		|		ПО ОстаткиТоваровОстатки.Товар = ЦеныПродажиТоваров.Товар
		|ГДЕ
		|	ОстаткиТоваровОстатки.Товар.Цвет = &Цвет";
	
	Запрос.УстановитьПараметр("Цвет", Товар.Цвет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 Стр = Склад.Добавить();
				Стр.Товар = ВыборкаДетальныеЗаписи.Товар;
				Стр.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
				Стр.Цена = ВыборкаДетальныеЗаписи.Цена;
			КонецЦикла;
			
ИначеЕсли НЕ Товар.Родитель.Пустая() И Товар.Производитель.Пустая() Тогда
	ОтборИЗаполнениеПоТипуИЦвету();
ИначеЕсли Товар.Родитель.Пустая() И НЕ Товар.Производитель.Пустая() Тогда
	ОтборИЗаполнениеПоПроизводителюИЦвету();
Иначе
	ОтборИЗаполнениеПоТипуПроизводителюИЦвету();
КонецЕсли;
КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварЦветПриИзменении(Элемент)
	ТоварЦветПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПродажаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;  
КонецПроцедуры

&НаКлиенте
Процедура ПродажаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("ДанныеФормыЭлементКоллекции") Тогда
		Стр = Продажа.Добавить();
		ЗаполнитьЗначенияСвойств(Стр,ПараметрыПеретаскивания.Значение);
	КонецЕсли;
КонецПроцедуры
