                                        
&НаКлиенте
Процедура СписокТоваровТоварПриИзменении(Элемент)
	Строка = Элементы.СписокТоваров.ТекущиеДанные;
	Строка.Цена = ПолучитьЦену(Строка.Товар);КонецПроцедуры
 
&НаСервере
Функция ПолучитьЦену(ТоварСсылка)

	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныЗакупкиТоваров.Товар.Ссылка КАК ТоварСсылка,
		|	ЦеныЗакупкиТоваров.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныЗакупкиТоваров КАК ЦеныЗакупкиТоваров
		|ГДЕ
		|	ЦеныЗакупкиТоваров.Товар.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТоварСсылка);
	
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;

	
КонецФункции

&НаКлиенте
Процедура СписокТоваровКоличествоПриИзменении(Элемент)
	Строка = Элементы.СписокТоваров.ТекущиеДанные;	
	Строка.Сумма = Строка.Количество * Строка.Цена;                                                
КонецПроцедуры


